# CHAPTAR 10 - DATA AGGREGATION AND GROUP OPERATIONS

In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({'key1' : ['a', 'a', 'b', 'b', 'a'],
                   'key2' : ['one', 'two', 'one', 'two', 'one'],
                   'data1' : np.random.randn(5),
                   'data2' : np.random.randn(5)
                   })

In [3]:
df

  key1 key2     data1     data2
0    a  one -0.720132 -0.811663
1    a  two -0.475218 -0.992632
2    b  one  0.165626 -2.168214
3    b  two  0.730900 -0.048990
4    a  one  1.329173 -0.019985

In [4]:
grouped = df['data1'].groupby(df['key1'])

In [5]:
grouped

In [6]:
grouped.mean()

key1
a    0.044608
b    0.448263
Name: data1, dtype: float64

In [7]:
means = df['data1'].groupby([df['key1'], df['key2']]).mean()

In [8]:
means

key1  key2
a     one     0.304521
      two    -0.475218
b     one     0.165626
      two     0.730900
Name: data1, dtype: float64

In [9]:
means.unstack()

key2       one       two
key1
a     0.304521 -0.475218
b     0.165626  0.730900

In [10]:
df.groupby('key1').mean()

         data1     data2
key1
a     0.044608 -0.608093
b     0.448263 -1.108602

In [11]:
df.groupby(['key1', 'key2']).mean()

              data1     data2
key1 key2
a    one   0.304521 -0.415824
     two  -0.475218 -0.992632
b    one   0.165626 -2.168214
     two   0.730900 -0.048990

In [12]:
df.groupby(['key1', 'key2']).size()

key1  key2
a     one     2
      two     1
b     one     1
      two     1
dtype: int64

## INTERATING OVER GROUPS

In [13]:
for name, group in df.groupby('key1'):
    print(name)
    print(group)

a
  key1 key2     data1     data2
0    a  one -0.720132 -0.811663
1    a  two -0.475218 -0.992632
4    a  one  1.329173 -0.019985
b
  key1 key2     data1     data2
2    b  one  0.165626 -2.168214
3    b  two  0.730900 -0.048990

In [14]:
for (k1, k2), group in df.groupby(['key1', 'key2']):
    print(k1, k2)
    print(group)

a one
  key1 key2     data1     data2
0    a  one -0.720132 -0.811663
4    a  one  1.329173 -0.019985
a two
  key1 key2     data1     data2
1    a  two -0.475218 -0.992632
b one
  key1 key2     data1     data2
2    b  one  0.165626 -2.168214
b two
  key1 key2   data1    data2
3    b  two  0.7309 -0.04899

In [15]:
pieces = dict(list(df.groupby('key1')))

In [16]:
pieces['a']

  key1 key2     data1     data2
0    a  one -0.720132 -0.811663
1    a  two -0.475218 -0.992632
4    a  one  1.329173 -0.019985

In [17]:
type(pieces['a'])

pandas.core.frame.DataFrame

In [18]:
df.dtypes

key1      object
key2      object
data1    float64
data2    float64
dtype: object

In [19]:
grouped = df.groupby(df.dtypes, axis=1)

In [20]:
grouped

In [21]:
for dtype, group in grouped:
    print(dtype)
    print(group)

float64
      data1     data2
0 -0.720132 -0.811663
1 -0.475218 -0.992632
2  0.165626 -2.168214
3  0.730900 -0.048990
4  1.329173 -0.019985
object
  key1 key2
0    a  one
1    a  two
2    b  one
3    b  two
4    a  one

## SELECTING A CLOUMN OR SUBSET OF COLUMNS

In [22]:
df.groupby('key1')['data1']

In [23]:
df.groupby('key1')[['data1']]

In [24]:
df.groupby('key1')['data1'].mean()

key1
a    0.044608
b    0.448263
Name: data1, dtype: float64

In [25]:
df.groupby('key1')[['data1']].mean()

         data1
key1
a     0.044608
b     0.448263

In [26]:
df.groupby('key1')[['data1']].head()

      data1
0 -0.720132
1 -0.475218
2  0.165626
3  0.730900
4  1.329173

In [27]:
df['data1'].groupby(df['key1'])

In [28]:
df[['data2']].groupby(df['key1'])

In [29]:
df.groupby(['key1', 'key2'])[['data2']].mean()

              data2
key1 key2
a    one  -0.415824
     two  -0.992632
b    one  -2.168214
     two  -0.048990

## GROUPING WITH DICTS AND SERIES

In [30]:
people = pd.DataFrame(np.random.randn(5, 5),
                      columns=['a', 'b', 'c', 'd', 'e'],
                      index=['Joe', 'Steve', 'Wes', 'Jim', 'Travis']
                      )

In [31]:
people

               a         b         c         d         e
Joe     1.311335  0.982578  0.097790 -0.322049  1.694488
Steve  -1.437407 -0.987654 -0.397850  1.596350 -1.203081
Wes    -0.189796 -0.370241 -0.187895 -0.340663 -0.293848
Jim    -0.549819 -0.479095  1.019092 -1.273894  0.018075
Travis -0.438960  0.487261 -0.133012 -0.181813 -1.167412

In [32]:
people.iloc[2:3, [1, 2]] = np.nan # Add a few NA values

In [33]:
people

               a         b         c         d         e
Joe     1.311335  0.982578  0.097790 -0.322049  1.694488
Steve  -1.437407 -0.987654 -0.397850  1.596350 -1.203081
Wes    -0.189796       NaN       NaN -0.340663 -0.293848
Jim    -0.549819 -0.479095  1.019092 -1.273894  0.018075
Travis -0.438960  0.487261 -0.133012 -0.181813 -1.167412

In [34]:
mapping = {'a': 'red', 'b': 'red', 'c': 'blue', 'd': 'blue', 'e': 'red', 'f' : 'orange'}

In [35]:
people.groupby(mapping, axis=1).sum()

            blue       red
Joe    -0.224259  3.988401
Steve   1.198500 -3.628142
Wes    -0.340663 -0.483644
Jim    -0.254802 -1.010839
Travis -0.314825 -1.119111

In [36]:
map_series = pd.Series(mapping)

In [37]:
map_series

a       red
b       red
c      blue
d      blue
e       red
f    orange
dtype: object

In [38]:
people.groupby(map_series, axis=1).count()

        blue  red
Joe        2    3
Steve      2    3
Wes        1    2
Jim        2    3
Travis     2    3

## GROUPING WITH FUNCTIONS

In [39]:
people.groupby(len).sum()

          a         b         c         d         e
3  0.571720  0.503483  1.116882 -1.936606  1.418715
5 -1.437407 -0.987654 -0.397850  1.596350 -1.203081
6 -0.438960  0.487261 -0.133012 -0.181813 -1.167412

In [40]:
key_list = ['one', 'one', 'one', 'two', 'two']

In [41]:
people.groupby([len, key_list]).min()

              a         b         c         d         e
3 one -0.189796  0.982578  0.097790 -0.340663 -0.293848
  two -0.549819 -0.479095  1.019092 -1.273894  0.018075
5 one -1.437407 -0.987654 -0.397850  1.596350 -1.203081
6 two -0.438960  0.487261 -0.133012 -0.181813 -1.167412

## GROUPING BY INDEX LEVELS

In [42]:
columns = pd.MultiIndex.from_arrays([['US', 'US', 'US', 'JP', 'JP'],
                                    [1, 3, 5, 1, 3]],
                                    names=['city', 'tenor'])

In [43]:
hier_df = pd.DataFrame(np.random.randn(4,5), columns=columns)

In [44]:
hier_df

city         US                            JP
tenor         1         3         5         1         3
0      1.663201  0.789674 -0.430933 -0.210173 -0.598672
1      0.884920 -1.191434  0.870612 -0.113282 -1.565276
2     -0.421487 -1.309715  0.517317  0.027376 -1.160813
3     -0.230771 -1.895309  2.501136 -0.651163 -0.313889

In [45]:
hier_df.groupby(level='city', axis=1).count()

city  JP  US
0      2   3
1      2   3
2      2   3
3      2   3

## DATA AGREGATION

In [46]:
df

  key1 key2     data1     data2
0    a  one -0.720132 -0.811663
1    a  two -0.475218 -0.992632
2    b  one  0.165626 -2.168214
3    b  two  0.730900 -0.048990
4    a  one  1.329173 -0.019985

In [47]:
grouped = df.groupby('key1')

In [48]:
grouped['data1'].quantile(0.9)

key1
a    0.968295
b    0.674372
Name: data1, dtype: float64

In [49]:
def peak_to_peak(arr):
    return arr.max() - arr.min()

In [50]:
grouped.agg(peak_to_peak)

         data1     data2
key1
a     2.049305  0.972647
b     0.565274  2.119224

In [51]:
df.data1.max()

1.3291731941173888

In [52]:
df.data1.min()

-0.7201321134870711

In [53]:
grouped.describe()

     data1                                                              \
     count      mean       std       min       25%       50%       75%
key1
a      3.0  0.044608  1.119186 -0.720132 -0.597675 -0.475218  0.426977
b      2.0  0.448263  0.399709  0.165626  0.306944  0.448263  0.589581

               data2                                                    \
           max count      mean       std       min       25%       50%
key1
a     1.329173   3.0 -0.608093  0.517292 -0.992632 -0.902148 -0.811663
b     0.730900   2.0 -1.108602  1.498518 -2.168214 -1.638408 -1.108602


           75%       max
key1
a    -0.415824 -0.019985
b    -0.578796 -0.048990

## COLUMN-WISE AND MULTIPLE FUNCIOTNS

In [54]:
tips = pd.read_csv('examples/tips.csv')

In [55]:
tips.head()

   total_bill   tip smoker  day    time  size
0       16.99  1.01     No  Sun  Dinner     2
1       10.34  1.66     No  Sun  Dinner     3
2       21.01  3.50     No  Sun  Dinner     3
3       23.68  3.31     No  Sun  Dinner     2
4       24.59  3.61     No  Sun  Dinner     4

In [57]:
tips['tip_pct'] = tips['tip'] / tips['total_bill']

In [58]:
tips.head()

   total_bill   tip smoker  day    time  size   tip_pct
0       16.99  1.01     No  Sun  Dinner     2  0.059447
1       10.34  1.66     No  Sun  Dinner     3  0.160542
2       21.01  3.50     No  Sun  Dinner     3  0.166587
3       23.68  3.31     No  Sun  Dinner     2  0.139780
4       24.59  3.61     No  Sun  Dinner     4  0.146808

In [59]:
grouped = tips.groupby(['day', 'smoker'])

In [63]:
grouped_pct = grouped['tip_pct']

In [65]:
grouped_pct.aggregate('mean')

day   smoker
Fri   No        0.151650
      Yes       0.174783
Sat   No        0.158048
      Yes       0.147906
Sun   No        0.160113
      Yes       0.187250
Thur  No        0.160298
      Yes       0.163863
Name: tip_pct, dtype: float64

In [66]:
grouped_pct.agg(['mean', 'std', peak_to_peak])

                 mean       std  peak_to_peak
day  smoker
Fri  No      0.151650  0.028123      0.067349
     Yes     0.174783  0.051293      0.159925
Sat  No      0.158048  0.039767      0.235193
     Yes     0.147906  0.061375      0.290095
Sun  No      0.160113  0.042347      0.193226
     Yes     0.187250  0.154134      0.644685
Thur No      0.160298  0.038774      0.193350
     Yes     0.163863  0.039389      0.151240

In [67]:
grouped_pct.agg([('foo', 'mean'), ('bar', np.std)])

                  foo       bar
day  smoker
Fri  No      0.151650  0.028123
     Yes     0.174783  0.051293
Sat  No      0.158048  0.039767
     Yes     0.147906  0.061375
Sun  No      0.160113  0.042347
     Yes     0.187250  0.154134
Thur No      0.160298  0.038774
     Yes     0.163863  0.039389

In [69]:
functions = ['count', 'mean', 'max']

In [71]:
result = grouped[['tip_pct', 'total_bill']].agg(functions)

In [72]:
result

            tip_pct                     total_bill
              count      mean       max      count       mean    max
day  smoker
Fri  No           4  0.151650  0.187735          4  18.420000  22.75
     Yes         15  0.174783  0.263480         15  16.813333  40.17
Sat  No          45  0.158048  0.291990         45  19.661778  48.33
     Yes         42  0.147906  0.325733         42  21.276667  50.81
Sun  No          57  0.160113  0.252672         57  20.506667  48.17
     Yes         19  0.187250  0.710345         19  24.120000  45.35
Thur No          45  0.160298  0.266312         45  17.113111  41.19
     Yes         17  0.163863  0.241255         17  19.190588  43.11

In [73]:
result['tip_pct']

             count      mean       max
day  smoker
Fri  No          4  0.151650  0.187735
     Yes        15  0.174783  0.263480
Sat  No         45  0.158048  0.291990
     Yes        42  0.147906  0.325733
Sun  No         57  0.160113  0.252672
     Yes        19  0.187250  0.710345
Thur No         45  0.160298  0.266312
     Yes        17  0.163863  0.241255

In [74]:
ftuples = [('Durchschnitt', 'mean'), ('Abweichung', np.var)]

In [76]:
grouped[['tip_pct', 'total_bill']].agg(ftuples)

                 tip_pct              total_bill
            Durchschnitt Abweichung Durchschnitt  Abweichung
day  smoker
Fri  No         0.151650   0.000791    18.420000   25.596333
     Yes        0.174783   0.002631    16.813333   82.562438
Sat  No         0.158048   0.001581    19.661778   79.908965
     Yes        0.147906   0.003767    21.276667  101.387535
Sun  No         0.160113   0.001793    20.506667   66.099980
     Yes        0.187250   0.023757    24.120000  109.046044
Thur No         0.160298   0.001503    17.113111   59.625081
     Yes        0.163863   0.001551    19.190588   69.808518

In [77]:
grouped.agg({'tip' : np.max, 'size' : 'sum'})

               tip  size
day  smoker
Fri  No       3.50     9
     Yes      4.73    31
Sat  No       9.00   115
     Yes     10.00   104
Sun  No       6.00   167
     Yes      6.50    49
Thur No       6.70   112
     Yes      5.00    40

In [78]:
grouped.agg({'tip_pct' : ['min', 'max', 'mean', 'std'], 'size' : 'sum'})

              tip_pct                               size
                  min       max      mean       std  sum
day  smoker
Fri  No      0.120385  0.187735  0.151650  0.028123    9
     Yes     0.103555  0.263480  0.174783  0.051293   31
Sat  No      0.056797  0.291990  0.158048  0.039767  115
     Yes     0.035638  0.325733  0.147906  0.061375  104
Sun  No      0.059447  0.252672  0.160113  0.042347  167
     Yes     0.065660  0.710345  0.187250  0.154134   49
Thur No      0.072961  0.266312  0.160298  0.038774  112
     Yes     0.090014  0.241255  0.163863  0.039389   40

## RETURNING AGREEGATED DATA WITHOUT ROW INDEXES

In [80]:
tips.groupby(['day', 'smoker'], as_index=False).mean()

    day smoker  total_bill       tip      size   tip_pct
0   Fri     No   18.420000  2.812500  2.250000  0.151650
1   Fri    Yes   16.813333  2.714000  2.066667  0.174783
2   Sat     No   19.661778  3.102889  2.555556  0.158048
3   Sat    Yes   21.276667  2.875476  2.476190  0.147906
4   Sun     No   20.506667  3.167895  2.929825  0.160113
5   Sun    Yes   24.120000  3.516842  2.578947  0.187250
6  Thur     No   17.113111  2.673778  2.488889  0.160298
7  Thur    Yes   19.190588  3.030000  2.352941  0.163863

In [82]:
tips.groupby(['day', 'smoker']).mean()

             total_bill       tip      size   tip_pct
day  smoker
Fri  No       18.420000  2.812500  2.250000  0.151650
     Yes      16.813333  2.714000  2.066667  0.174783
Sat  No       19.661778  3.102889  2.555556  0.158048
     Yes      21.276667  2.875476  2.476190  0.147906
Sun  No       20.506667  3.167895  2.929825  0.160113
     Yes      24.120000  3.516842  2.578947  0.187250
Thur No       17.113111  2.673778  2.488889  0.160298
     Yes      19.190588  3.030000  2.352941  0.163863

## APPLY: GENERAL SPLIT-APPLY-COMBINE

In [84]:
def top(df, n=5, column='tip_pct'):
    return df.sort_values(by=column)[-n:]

In [85]:
top(tips, n=6)

     total_bill   tip smoker  day    time  size   tip_pct
109       14.31  4.00    Yes  Sat  Dinner     2  0.279525
183       23.17  6.50    Yes  Sun  Dinner     4  0.280535
232       11.61  3.39     No  Sat  Dinner     2  0.291990
67         3.07  1.00    Yes  Sat  Dinner     1  0.325733
178        9.60  4.00    Yes  Sun  Dinner     2  0.416667
172        7.25  5.15    Yes  Sun  Dinner     2  0.710345

In [86]:
tips.groupby('smoker').apply(top)

            total_bill   tip smoker   day    time  size   tip_pct
smoker
No     88        24.71  5.85     No  Thur   Lunch     2  0.236746
       185       20.69  5.00     No   Sun  Dinner     5  0.241663
       51        10.29  2.60     No   Sun  Dinner     2  0.252672
       149        7.51  2.00     No  Thur   Lunch     2  0.266312
       232       11.61  3.39     No   Sat  Dinner     2  0.291990
Yes    109       14.31  4.00    Yes   Sat  Dinner     2  0.279525
       183       23.17  6.50    Yes   Sun  Dinner     4  0.280535
       67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
       178        9.60  4.00    Yes   Sun  Dinner     2  0.416667
       172        7.25  5.15    Yes   Sun  Dinner     2  0.710345

In [88]:
tips.groupby(['smoker', 'day']).apply(top, n=1, column='total_bill')

                 total_bill    tip smoker   day    time  size   tip_pct
smoker day
No     Fri  94        22.75   3.25     No   Fri  Dinner     2  0.142857
       Sat  212       48.33   9.00     No   Sat  Dinner     4  0.186220
       Sun  156       48.17   5.00     No   Sun  Dinner     6  0.103799
       Thur 142       41.19   5.00     No  Thur   Lunch     5  0.121389
Yes    Fri  95        40.17   4.73    Yes   Fri  Dinner     4  0.117750
       Sat  170       50.81  10.00    Yes   Sat  Dinner     3  0.196812
       Sun  182       45.35   3.50    Yes   Sun  Dinner     3  0.077178
       Thur 197       43.11   5.00    Yes  Thur   Lunch     4  0.115982

In [91]:
result = tips.groupby(['smoker', 'day']).apply(top, n=1, column='total_bill')

In [92]:
result

                 total_bill    tip smoker   day    time  size   tip_pct
smoker day
No     Fri  94        22.75   3.25     No   Fri  Dinner     2  0.142857
       Sat  212       48.33   9.00     No   Sat  Dinner     4  0.186220
       Sun  156       48.17   5.00     No   Sun  Dinner     6  0.103799
       Thur 142       41.19   5.00     No  Thur   Lunch     5  0.121389
Yes    Fri  95        40.17   4.73    Yes   Fri  Dinner     4  0.117750
       Sat  170       50.81  10.00    Yes   Sat  Dinner     3  0.196812
       Sun  182       45.35   3.50    Yes   Sun  Dinner     3  0.077178
       Thur 197       43.11   5.00    Yes  Thur   Lunch     4  0.115982

In [93]:
result.unstack('smoker')

         total_bill          tip        smoker        day          time  \
smoker           No    Yes    No    Yes     No  Yes    No   Yes      No
day
Fri  94       22.75    NaN  3.25    NaN     No  NaN   Fri   NaN  Dinner
     95         NaN  40.17   NaN   4.73    NaN  Yes   NaN   Fri     NaN
Sat  170        NaN  50.81   NaN  10.00    NaN  Yes   NaN   Sat     NaN
     212      48.33    NaN  9.00    NaN     No  NaN   Sat   NaN  Dinner
Sun  156      48.17    NaN  5.00    NaN     No  NaN   Sun   NaN  Dinner
     182        NaN  45.35   NaN   3.50    NaN  Yes   NaN   Sun     NaN
Thur 142      41.19    NaN  5.00    NaN     No  NaN  Thur   NaN   Lunch
     197        NaN  43.11   NaN   5.00    NaN  Yes   NaN  Thur     NaN

                 size        tip_pct
smoker       Yes   No  Yes        No       Yes
day
Fri  94      NaN  2.0  NaN  0.142857       NaN
     95   Dinner  NaN  4.0       NaN  0.117750
Sat  170  Dinner  NaN  3.0       NaN  0.196812
     212     NaN  4.0  NaN  0.186220       NaN
Sun  156     NaN  6.0  NaN  0.103799       NaN
     182  Dinner  NaN  3.0       NaN  0.077178
Thur 142     NaN  5.0  NaN  0.121389       NaN
     197   Lunch  NaN  4.0       NaN  0.115982

## SUPRESSING THE GROUP KEYS

In [95]:
tips.groupby('smoker', group_keys=False).apply(top)

     total_bill   tip smoker   day    time  size   tip_pct
88        24.71  5.85     No  Thur   Lunch     2  0.236746
185       20.69  5.00     No   Sun  Dinner     5  0.241663
51        10.29  2.60     No   Sun  Dinner     2  0.252672
149        7.51  2.00     No  Thur   Lunch     2  0.266312
232       11.61  3.39     No   Sat  Dinner     2  0.291990
109       14.31  4.00    Yes   Sat  Dinner     2  0.279525
183       23.17  6.50    Yes   Sun  Dinner     4  0.280535
67         3.07  1.00    Yes   Sat  Dinner     1  0.325733
178        9.60  4.00    Yes   Sun  Dinner     2  0.416667
172        7.25  5.15    Yes   Sun  Dinner     2  0.710345

## QUANTILE AND BUCKET ANALYSIS

In [97]:
frame = pd.DataFrame({'data1': np.random.randn(1000), 'data2': np.random.randn(1000)})

In [99]:
quartiles = pd.cut(frame.data1, 4)

In [100]:
quartiles[:10]

0    (0.0218, 1.704]
1    (-1.66, 0.0218]
2    (0.0218, 1.704]
3    (0.0218, 1.704]
4    (0.0218, 1.704]
5    (-1.66, 0.0218]
6    (-1.66, 0.0218]
7    (0.0218, 1.704]
8    (-1.66, 0.0218]
9    (-1.66, 0.0218]
Name: data1, dtype: category
Categories (4, interval[float64]): [(-3.349, -1.66] < (-1.66, 0.0218] < (0.0218, 1.704] < (1.704, 3.386]]

In [101]:
def get_stats(group):
    return {'min': group.min(), 'max': group.max(), 'count': group.count(), 'mean': group.mean()}

In [102]:
grouped = frame.data2.groupby(quartiles)

In [104]:
grouped.apply(get_stats).unstack()

                      min       max  count      mean
data1
(-3.349, -1.66] -1.525174  1.476617   41.0 -0.098213
(-1.66, 0.0218] -2.711454  3.109334  439.0 -0.029357
(0.0218, 1.704] -2.610454  3.614956  474.0 -0.081102
(1.704, 3.386]  -2.247627  2.058528   46.0  0.243103

In [106]:
grouped.apply(get_stats)

data1
(-3.349, -1.66]  min       -1.525174
                 max        1.476617
                 count     41.000000
                 mean      -0.098213
(-1.66, 0.0218]  min       -2.711454
                 max        3.109334
                 count    439.000000
                 mean      -0.029357
(0.0218, 1.704]  min       -2.610454
                 max        3.614956
                 count    474.000000
                 mean      -0.081102
(1.704, 3.386]   min       -2.247627
                 max        2.058528
                 count     46.000000
                 mean       0.243103
Name: data2, dtype: float64

In [105]:
grouped.apply(get_stats).unstack()

                      min       max  count      mean
data1
(-3.349, -1.66] -1.525174  1.476617   41.0 -0.098213
(-1.66, 0.0218] -2.711454  3.109334  439.0 -0.029357
(0.0218, 1.704] -2.610454  3.614956  474.0 -0.081102
(1.704, 3.386]  -2.247627  2.058528   46.0  0.243103

In [108]:
grouping = pd.qcut(frame.data1, 10, labels=False)

In [109]:
grouped = frame.data2.groupby(grouping)

In [110]:
grouped.apply(get_stats).unstack()

            min       max  count      mean
data1
0     -2.481642  2.181490  100.0 -0.021375
1     -2.630035  1.683377  100.0 -0.208538
2     -2.244114  2.382756  100.0 -0.019098
3     -2.061422  3.109334  100.0  0.258913
4     -2.711454  2.452928  100.0 -0.199279
5     -2.458527  2.102948  100.0 -0.214619
6     -2.610454  2.246042  100.0 -0.105178
7     -2.027008  1.714267  100.0 -0.099445
8     -1.978063  3.614956  100.0  0.054328
9     -2.247627  2.559189  100.0  0.112555

## EXAMPLE: FILLING MISSING VALUES WITH GROUPS WITH GROUP-SPECIFT VALUES

In [112]:
s = pd.Series(np.random.randn(6))

In [113]:
s[::2] = np.nan

In [114]:
s.fillna(s.mean())

0   -0.177449
1   -1.800218
2   -0.177449
3    0.425283
4   -0.177449
5    0.842589
dtype: float64

In [115]:
 states = ['Ohio', 'New York', 'Vermont', 'Florida', 'Oregon', 'Nevada', 'California', 'Idaho']

In [116]:
group_key = ['East'] * 4 + ['West'] * 4

In [117]:
data = pd.Series(np.random.randn(8), index=states)

In [121]:
data

Ohio          0.843489
New York      0.881191
Vermont       0.944110
Florida       0.510915
Oregon       -0.093884
Nevada       -0.213625
California    1.130201
Idaho        -0.710554
dtype: float64

In [122]:
data[['Vermont', 'Nevada', 'Idaho']] = np.nan

In [123]:
data

Ohio          0.843489
New York      0.881191
Vermont            NaN
Florida       0.510915
Oregon       -0.093884
Nevada             NaN
California    1.130201
Idaho              NaN
dtype: float64

In [125]:
data.groupby(group_key).mean()

East    0.745198
West    0.518159
dtype: float64

In [126]:
fill_mean = lambda g: g.fillna(g.mean())

In [127]:
fill_mean = lambda g: g.fillna(g.mean())

In [128]:
fill_values = {'East': 0.5, 'West': -1}

In [129]:
fill_func = lambda g: g.fillna(fill_values[g.name])

In [132]:
data.groupby(group_key).apply(fill_func)

Ohio          0.843489
New York      0.881191
Vermont       0.500000
Florida       0.510915
Oregon       -0.093884
Nevada       -1.000000
California    1.130201
Idaho        -1.000000
dtype: float64

## EXAMPLE: RANDOM SAMPLING AND PERMUTATION

In [140]:
# Hearts, Spades, Clubs, Diamonds
suits = ['H', 'S', 'C', 'D']
card_val = (list(range(1, 11)) + [10] * 3) * 4
base_names = ['A'] + list(range(2, 11)) + ['J', 'K', 'Q']

In [141]:
cards = []
for suit in ['H', 'S', 'C', 'D']:
    cards.extend(str(num) + suit for num in base_names)

In [143]:
deck = pd.Series(card_val, index=cards)

In [144]:
deck

AH      1
2H      2
3H      3
4H      4
5H      5
6H      6
7H      7
8H      8
9H      9
10H    10
JH     10
KH     10
QH     10
AS      1
2S      2
3S      3
4S      4
5S      5
6S      6
7S      7
8S      8
9S      9
10S    10
JS     10
KS     10
QS     10
AC      1
2C      2
3C      3
4C      4
5C      5
6C      6
7C      7
8C      8
9C      9
10C    10
JC     10
KC     10
QC     10
AD      1
2D      2
3D      3
4D      4
5D      5
6D      6
7D      7
8D      8
9D      9
10D    10
JD     10
KD     10
QD     10
dtype: int64

In [145]:
def draw(deck, n=5):
    return deck.sample(n)

In [150]:
draw(deck)

8S     8
5H     5
KH    10
3C     3
QS    10
dtype: int64

In [152]:
get_suit = lambda card: card[-1] # last letter is suit

In [153]:
deck.groupby(get_suit).apply(draw, n=2)

C  3C      3
   10C    10
D  AD      1
   9D      9
H  2H      2
   JH     10
S  5S      5
   8S      8
dtype: int64

In [154]:
deck.groupby(get_suit, group_keys=False).apply(draw, n=2)

9C     9
4C     4
KD    10
4D     4
2H     2
6H     6
5S     5
AS     1
dtype: int64

## EXAMPLE: GROUP WEIGHTED AVERAGE AND CORRELATIONS

In [155]:
df = pd.DataFrame({'category': ['a', 'a', 'a', 'a', 'b', 'b', 'b', 'b'],
                   'data': np.random.randn(8),
                   'weights': np.random.rand(8)})

In [156]:
df

  category      data   weights
0        a -0.783142  0.312654
1        a  0.015503  0.158728
2        a -0.657037  0.450908
3        a  0.026142  0.411357
4        b  0.718762  0.045470
5        b  1.012259  0.915089
6        b  0.515041  0.274778
7        b  0.189386  0.786166

In [157]:
grouped = df.groupby('category')

In [160]:
get_wavg = lambda g: np.average(g['data'], weights=g['weights'])

In [161]:
grouped.apply(get_wavg)

category
a   -0.395833
b    0.618055
dtype: float64

In [162]:
close_px = pd.read_csv('examples/stock_px_2.csv', parse_dates=True, index_col=0)

In [163]:
close_px.head()

            AAPL   MSFT    XOM     SPX
2003-01-02  7.40  21.11  29.22  909.03
2003-01-03  7.45  21.14  29.24  908.59
2003-01-06  7.45  21.52  29.96  929.01
2003-01-07  7.43  21.93  28.95  922.93
2003-01-08  7.28  21.31  28.83  909.93

In [165]:
close_px.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 2214 entries, 2003-01-02 to 2011-10-14
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   AAPL    2214 non-null   float64
 1   MSFT    2214 non-null   float64
 2   XOM     2214 non-null   float64
 3   SPX     2214 non-null   float64
dtypes: float64(4)
memory usage: 166.5 KB

In [167]:
close_px[-4:]

              AAPL   MSFT    XOM      SPX
2011-10-11  400.29  27.00  76.27  1195.54
2011-10-12  402.19  26.96  77.16  1207.25
2011-10-13  408.43  27.18  76.37  1203.66
2011-10-14  422.00  27.27  78.11  1224.58

In [168]:
spx_corr = lambda x: x.corrwith(x['SPX'])

In [169]:
rets = close_px.pct_change().dropna()

In [170]:
rets

                AAPL      MSFT       XOM       SPX
2003-01-03  0.006757  0.001421  0.000684 -0.000484
2003-01-06  0.000000  0.017975  0.024624  0.022474
2003-01-07 -0.002685  0.019052 -0.033712 -0.006545
2003-01-08 -0.020188 -0.028272 -0.004145 -0.014086
2003-01-09  0.008242  0.029094  0.021159  0.019386
...              ...       ...       ...       ...
2011-10-10  0.051406  0.026286  0.036977  0.034125
2011-10-11  0.029526  0.002227 -0.000131  0.000544
2011-10-12  0.004747 -0.001481  0.011669  0.009795
2011-10-13  0.015515  0.008160 -0.010238 -0.002974
2011-10-14  0.033225  0.003311  0.022784  0.017380

[2213 rows x 4 columns]

In [171]:
get_year = lambda x: x.year

In [172]:
by_year = rets.groupby(get_year)

In [173]:
by_year.apply(spx_corr)

          AAPL      MSFT       XOM  SPX
2003  0.541124  0.745174  0.661265  1.0
2004  0.374283  0.588531  0.557742  1.0
2005  0.467540  0.562374  0.631010  1.0
2006  0.428267  0.406126  0.518514  1.0
2007  0.508118  0.658770  0.786264  1.0
2008  0.681434  0.804626  0.828303  1.0
2009  0.707103  0.654902  0.797921  1.0
2010  0.710105  0.730118  0.839057  1.0
2011  0.691931  0.800996  0.859975  1.0

In [174]:
by_year.apply(lambda g: g['AAPL'].corr(g['MSFT']))

2003    0.480868
2004    0.259024
2005    0.300093
2006    0.161735
2007    0.417738
2008    0.611901
2009    0.432738
2010    0.571946
2011    0.581987
dtype: float64

## EXAMPLE: GROUP-WISE LINEAR REGRESSION

In [176]:
import statsmodels.api as sm

In [177]:
def regress(data, yvar, xvars):
    Y = data[yvar]
    X = data[xvars]
    X['intercept'] = 1.
    result = sm.OLS(Y, X).fit()
    return result.params

In [178]:
by_year.apply(regress, 'AAPL', ['SPX'])

           SPX  intercept
2003  1.195406   0.000710
2004  1.363463   0.004201
2005  1.766415   0.003246
2006  1.645496   0.000080
2007  1.198761   0.003438
2008  0.968016  -0.001110
2009  0.879103   0.002954
2010  1.052608   0.001261
2011  0.806605   0.001514

## PIVOT TABLES AND CROSS-TABULATION

In [179]:
tips.head()

   total_bill   tip smoker  day    time  size   tip_pct
0       16.99  1.01     No  Sun  Dinner     2  0.059447
1       10.34  1.66     No  Sun  Dinner     3  0.160542
2       21.01  3.50     No  Sun  Dinner     3  0.166587
3       23.68  3.31     No  Sun  Dinner     2  0.139780
4       24.59  3.61     No  Sun  Dinner     4  0.146808

In [180]:
tips.pivot_table(index=['day', 'smoker'])

                 size       tip   tip_pct  total_bill
day  smoker
Fri  No      2.250000  2.812500  0.151650   18.420000
     Yes     2.066667  2.714000  0.174783   16.813333
Sat  No      2.555556  3.102889  0.158048   19.661778
     Yes     2.476190  2.875476  0.147906   21.276667
Sun  No      2.929825  3.167895  0.160113   20.506667
     Yes     2.578947  3.516842  0.187250   24.120000
Thur No      2.488889  2.673778  0.160298   17.113111
     Yes     2.352941  3.030000  0.163863   19.190588

In [182]:
tips.pivot_table(['tip_pct', 'size'], index=['time', 'day'], columns='smoker')

                 size             tip_pct
smoker             No       Yes        No       Yes
time   day
Dinner Fri   2.000000  2.222222  0.139622  0.165347
       Sat   2.555556  2.476190  0.158048  0.147906
       Sun   2.929825  2.578947  0.160113  0.187250
       Thur  2.000000       NaN  0.159744       NaN
Lunch  Fri   3.000000  1.833333  0.187735  0.188937
       Thur  2.500000  2.352941  0.160311  0.163863

In [183]:
tips.pivot_table(['tip_pct', 'size'], index=['time', 'day'], columns='smoker', margins=True)

                 size                       tip_pct
smoker             No       Yes       All        No       Yes       All
time   day
Dinner Fri   2.000000  2.222222  2.166667  0.139622  0.165347  0.158916
       Sat   2.555556  2.476190  2.517241  0.158048  0.147906  0.153152
       Sun   2.929825  2.578947  2.842105  0.160113  0.187250  0.166897
       Thur  2.000000       NaN  2.000000  0.159744       NaN  0.159744
Lunch  Fri   3.000000  1.833333  2.000000  0.187735  0.188937  0.188765
       Thur  2.500000  2.352941  2.459016  0.160311  0.163863  0.161301
All          2.668874  2.408602  2.569672  0.159328  0.163196  0.160803

In [189]:
tips.pivot_table(['tip_pct', 'size'],
                 index=['time', 'day'],
                 columns='smoker',
                 margins=True,
                 aggfunc=len,
                 fill_value=0)

            size          tip_pct
smoker        No Yes  All      No Yes    All
time   day
Dinner Fri     3   9   12       3   9   12.0
       Sat    45  42   87      45  42   87.0
       Sun    57  19   76      57  19   76.0
       Thur    1   0    1       1   0    1.0
Lunch  Fri     1   6    7       1   6    7.0
       Thur   44  17   61      44  17   61.0
All          151  93  244     151  93  244.0

## CROSS-TABULATIONS: CROSTAB

In [192]:
pd.crosstab(tips.time, tips.day, margins=True)

day     Fri  Sat  Sun  Thur  All
time
Dinner   12   87   76     1  176
Lunch     7    0    0    61   68
All      19   87   76    62  244

In [193]:
pd.crosstab([tips.time, tips.day], tips.smoker, margins=True)

smoker        No  Yes  All
time   day
Dinner Fri     3    9   12
       Sat    45   42   87
       Sun    57   19   76
       Thur    1    0    1
Lunch  Fri     1    6    7
       Thur   44   17   61
All          151   93  244